esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
#include "stm32_trg_driver.h"
//#include "main.h"
//#include "nsprs_platform_nucleo_g070rb.h"
#include "stm32g0xx_hal.h"

void trg_init_tmr16(void){
	//clk enable
	  __HAL_RCC_TIM16_CLK_ENABLE();
	  __HAL_RCC_GPIOA_CLK_ENABLE();
	// TIM16 GPIO Configuration, PA6     ------> TIM16_CH1 */
	  GPIO_InitTypeDef GPIO_InitStruct = {0};
	  GPIO_InitStruct.Pin = GPIO_PIN_6;
	  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	  GPIO_InitStruct.Pull = GPIO_NOPULL;
	  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	  GPIO_InitStruct.Alternate = GPIO_AF5_TIM16;
	  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	  //reg initialization
	  TIM16->CR1 &= ~TIM_CR1_CEN; //disable timer
	  TIM16->CR1 &= ~TIM_CR1_DIR; //up counter
	   TIM16->CR1 |= TIM_CR1_URS; //1: Only counter overflow/underflow generates an update interrupt or DMA request if enabled. (not setting UG bit)
//	   TIM16->CR1 |= TIM_CR1_UDIS;
	   TIM16->RCR = 0; //Repetition counter value
	   TIM16->CR1 &= ~TIM_CR1_ARPE; //AutoReloadPreload disabled
//	   TIM16->SR &= ~TIM_SR_UIF;
	     TIM16->DIER |= TIM_DIER_UIE; // enable update interrupts
	 	TIM16->BDTR |= (TIM_BDTR_MOE); //1: OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in TIMx_CCER register)
	   TIM16->CCMR1 &= ~TIM_CCMR1_CC1S_0;  //configuring as output
	   TIM16->CCMR1 &= ~TIM_CCMR1_CC1S_1;
	   TIM16->CCER |= TIM_CCER_CC1E; //Output enabled
	   TIM16->CCER &= ~TIM_CCER_CC1P; //0: OC1 active high
	   TIM16->PSC = 15; 	//resolution in 1us
//	   TIM16->CCER &= ~TIM_CCER_CC1NP;
	   TIM16->EGR |= TIM_EGR_UG;

	   NVIC_SetPriority(TIM16_IRQn, 3);
	   NVIC_SetVector(TIM16_IRQn, (uint32_t)&TIM16_IRQHandler);
}



void trg_impl_tmr16(int mode, unsigned int t1, unsigned int t2, unsigned int l_pwm, unsigned int h_pwm){

	mode_tmr16 = mode; //save to be used in isr
	 t1_tmr16 = t1;
	 t2_tmr16 = t2;
	 l_pwm_tmr16 = l_pwm;
	 h_pwm_tmr16 = h_pwm;
	num_pulse_pwm_tmr16 = 0; //initialize in the required mode

//#define 				0
//#define 				1
//#define 			2
//#define 			3
//#define TRG_MODE_T1LOW_T2HIGH_LOW	4
//#define TRG_MODE_T1HIGH_T2LOW_HIGH	5
//#define TRG_MODE_T1PWM_LOW			6
//#define TRG_MODE_T1PWM_HIGH			7
//#define TRG_MODE_T1PWM_T2HIGH_LOW	8
//#define TRG_MODE_T1PWM_T2LOW_HIGH	9
//#define TRG_MODE_T1HIGH_T2PWM_LOW	10
//#define TRG_MODE_T1LOW_T2PWM_HIGH	11


	if (mode_tmr16 == TRG_MODE_LOW){
		//==put low
//		   TIM16->PSC = 15999;
		   // shart bezaram agar az 1000 bozorg tar bud ms esh bokonam (ya bar asase pwm hast ya na)
		     TIM16->ARR = 1000;
		   // channel register
		   TIM16->CCR1 = 200;
		   //put low
		 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		 	// update generation: Re-initialize the counter and generates an update of the registers.

		   TIM16->EGR |= TIM_EGR_UG;
		   TIM16->CR1 |= TIM_CR1_CEN;

	}
	else if(mode_tmr16 == TRG_MODE_HIGH){
		//==put high
	 	TIM16->CCMR1 |= TIM_CCMR1_OC1M_0;
	 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
	 	TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
	 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

	   TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr16 == TRG_MODE_T1HIGH_LOW){
		//==put high for t1, then put low
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)t1_tmr16;
		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr16 == TRG_MODE_T1LOW_HIGH){
		//==put low for t1, then put high
		//put low
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)t1_tmr16;
		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr16 == 4){
		//==put low for t1, then put high for t2, then put low
		//put low
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)t1_tmr16;
		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr16 == 5){
		//==put high for t1, then put low for t2, then put high
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)t1_tmr16;
		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr16 == 6){
		//==start pwm for t1 (number of pulses should calculated), then put low
		num_pulse_pwm_tmr16 = (t1)/(l_pwm_tmr16+h_pwm_tmr16);

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)(h_pwm_tmr16+l_pwm_tmr16);
	  TIM16->CCR1 = (uint32_t)h_pwm_tmr16;

	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
	TIM16->CCMR1 |= TIM_CCMR1_OC1M_1;
	TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

	TIM16->EGR |= TIM_EGR_UG;
   TIM16->CR1 |= TIM_CR1_CEN;


	}
	else if (mode_tmr16 == 7){
		//==start pwm for t1, then put high
		num_pulse_pwm_tmr16 = (t1)/(l_pwm_tmr16+h_pwm_tmr16);

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)(h_pwm_tmr16+l_pwm_tmr16);
	  TIM16->CCR1 = (uint32_t)h_pwm_tmr16;

		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr16 == 8){
		//==start pwm for t1, then put high for t2, then put low
		num_pulse_pwm_tmr16 = (t1)/(l_pwm_tmr16+h_pwm_tmr16);

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)(h_pwm_tmr16+l_pwm_tmr16);
	  TIM16->CCR1 = (uint32_t)h_pwm_tmr16;

		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;

