esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
	}
	else if (mode_tmr16 == 9){
		//==start pwm for t1, then put low for t2, then put high
		num_pulse_pwm_tmr16 = (t1)/(l_pwm_tmr16+h_pwm_tmr16);

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)(h_pwm_tmr16+l_pwm_tmr16);
	  TIM16->CCR1 = (uint32_t)h_pwm_tmr16;

		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr16 == 10){
		//==put high for t1, then start pwm for t2, then put low
		num_pulse_pwm_tmr16 = (t2)/(l_pwm_tmr16+h_pwm_tmr16);

		TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)t1_tmr16;
		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr16 == 11){
		//==put low for t1, then start pwm for t2, then put high
		num_pulse_pwm_tmr16 = (t2)/(l_pwm_tmr16+h_pwm_tmr16);

		//put low
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM16->PSC = 15999; //us resolution
		TIM16->ARR = (uint32_t)t1_tmr16;
		TIM16->EGR |= TIM_EGR_UG;
	   TIM16->CR1 |= TIM_CR1_CEN;
	}


	TIM16->SR &= ~TIM_SR_UIF;
   NVIC_EnableIRQ(TIM16_IRQn); // Enable interrupt from TIM3 (NVIC level)
}


void TIM16_IRQHandler(void) // interrupt routine
{
	  if(TIM16->SR & TIM_SR_UIF) // if UIF flag is set
	  {
	    TIM16->SR &= ~TIM_SR_UIF; // clear UIF flag


		if (mode_tmr16 == TRG_MODE_LOW){
			//do nothing
		}
		else if(mode_tmr16 == TRG_MODE_HIGH){
			//do nothing
		}
		else if (mode_tmr16 == TRG_MODE_T1HIGH_LOW){
			//==when recieve intr(t1 done), put low
			//put low
		 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		   TIM16->EGR |= TIM_EGR_UG;
		   TIM16->CR1 &= ~TIM_CR1_CEN; //disable

		}
		else if (mode_tmr16 == TRG_MODE_T1LOW_HIGH){
			//==when recieve put high
			TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
			TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
			TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			TIM16->EGR |= TIM_EGR_UG;
		   TIM16->CR1 &= ~TIM_CR1_CEN; //disable
		}
		else if (mode_tmr16 == 4){
			//==put low for t1, then put high for t2, then put low
			static int mode4_cntr = 0;
			//first recieve: put high, set for t2
			//2nd rec: put low
			if (mode4_cntr == 0){
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM16->ARR = (uint32_t)t2_tmr16;
				TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 |= TIM_CR1_CEN;

			   mode4_cntr++;
			}
			else{
				//put low
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 &= ~TIM_CR1_CEN; //disable
				mode4_cntr = 0;
			}
		}
		else if (mode_tmr16 == 5){
			//==put high for t1, then put low for t2, then put high
			static int mode5_cntr = 0;
			//1st rec: put low, set for t2
			//2nd rec: put high
			if (mode5_cntr == 0){
				//put low
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM16->ARR = (uint32_t)t2_tmr16;
				TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 |= TIM_CR1_CEN;

			   mode5_cntr++;
			}
			else{

				TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 &= ~TIM_CR1_CEN; //disable
				mode5_cntr = 0;
			}

		}
		else if (mode_tmr16 == 6){
			//==start pwm for t1 (number of pulses should calculated), then put low
			//count numbers, when reached the value, then put low just
			static int mode6_cntr = 0;
			if(mode6_cntr<num_pulse_pwm_tmr16){
				mode6_cntr++;
			}
			else{
				//put low
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 &= ~TIM_CR1_CEN; //disable
				mode6_cntr=0;
			}

		}
		else if (mode_tmr16 == 7){
			//==start pwm for t1, then put high
			//count num of intr, when reached put high
			static int mode7_cntr = 0;
			if(mode7_cntr<num_pulse_pwm_tmr16){
				mode7_cntr++;
			}
			else{
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 &= ~TIM_CR1_CEN; //disable
				mode7_cntr=0;
			}
		}
		else if (mode_tmr16 == 8){
			//==start pwm for t1, then put high for t2, then put low
			//count numbers, when reached put high, set timer for t2, pwm_dis, the intr after that put low
			static int mode8_cntr1 = 0;
			static int mode8_cntr2 = 0;
			if(mode8_cntr1 == 0){ //state 1
				if(mode8_cntr2<num_pulse_pwm_tmr16){ //pwm counter
					mode8_cntr2++;
				}
				else{
					TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM16->ARR = (uint32_t)t2_tmr16;
					TIM16->EGR |= TIM_EGR_UG;
				   TIM16->CR1 |= TIM_CR1_CEN;

				   mode8_cntr2=0;
				   mode8_cntr1++;
				}
			}
			else{	//state 2
				//put low
			 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
			 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			 	TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
			 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 &= ~TIM_CR1_CEN; //disable
			   mode8_cntr2=0;
			   mode8_cntr1=0;
			}

