esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
		}
		else if (mode_tmr16 == 9){
			//==start pwm for t1, then put low for t2, then put high
			//count numbers, when reached put low, set timer for t2, pwm_dis, the intr after that put high
			static int mode9_cntr1 = 0;
			static int mode9_cntr2 = 0;
			if(mode9_cntr1 == 0){ //state 1
				if(mode9_cntr2<num_pulse_pwm_tmr16){ //pwm counter
					mode9_cntr2++;
				}
				else{
					//put low
				 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM16->ARR = (uint32_t)t2_tmr16;
					TIM16->EGR |= TIM_EGR_UG;
				   TIM16->CR1 |= TIM_CR1_CEN;

				   mode9_cntr2=0;
				   mode9_cntr1++;
				}
			}
			else{	//state 2
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			   TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 &= ~TIM_CR1_CEN; //disable
			   mode9_cntr2=0;
			   mode9_cntr1=0;
			}
		}
		else if (mode_tmr16 == 10){
			//==put high for t1, then start pwm for t2, then put low
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put low
			static int mode10_cntr1 = 0;
			static int mode10_cntr2 = 0;

			if (mode10_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM16->PSC = 15999; //1us resolution
				TIM16->ARR = (uint32_t)(h_pwm_tmr16+l_pwm_tmr16);
			  TIM16->CCR1 = (uint32_t)h_pwm_tmr16;

				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 |= TIM_CR1_CEN;

				mode10_cntr1++; //go to next state
				mode10_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode10_cntr2<num_pulse_pwm_tmr16){ //pwm counter
					mode10_cntr2++;
				}
				else{
					//put low
				 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM16->ARR = (uint32_t)t2_tmr16;
					TIM16->EGR |= TIM_EGR_UG;
					TIM16->CR1 &= ~TIM_CR1_CEN; //disable

				   mode10_cntr2=0;
				   mode10_cntr1=0;
				}
			}

		}
		else if (mode_tmr16 == 11){
			//==put low for t1, then start pwm for t2, then put high
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put high
			static int mode11_cntr1 = 0;
			static int mode11_cntr2 = 0;

			if (mode11_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM16->PSC = 15999; //us resolution
				TIM16->ARR = (uint32_t)(h_pwm_tmr16+l_pwm_tmr16);
			  TIM16->CCR1 = (uint32_t)h_pwm_tmr16;

				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM16->EGR |= TIM_EGR_UG;
			   TIM16->CR1 |= TIM_CR1_CEN;

				mode11_cntr1++; //go to next state
				mode11_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode11_cntr2<num_pulse_pwm_tmr16){ //pwm counter
					mode11_cntr2++;
				}
				else{
					TIM16->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM16->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM16->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM16->ARR = (uint32_t)t2_tmr16;
					TIM16->EGR |= TIM_EGR_UG;
					TIM16->CR1 &= ~TIM_CR1_CEN; //disable

				   mode11_cntr2=0;
				   mode11_cntr1=0;
				}
			}
		}

	  }
}


//================== TIM17 TRIGGER ====================

void trg_init_tmr17(void){
	//clk enable
	  __HAL_RCC_TIM17_CLK_ENABLE();

	  __HAL_RCC_GPIOA_CLK_ENABLE();
	  /**TIM17 GPIO Configuration, PA7     ------> TIM17_CH1 */
	  GPIO_InitTypeDef GPIO_InitStruct = {0};
	  GPIO_InitStruct.Pin = GPIO_PIN_7;
	  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	  GPIO_InitStruct.Pull = GPIO_NOPULL;
	  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	  GPIO_InitStruct.Alternate = GPIO_AF5_TIM17;
	  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	  //reg initialization
	  TIM17->CR1 &= ~TIM_CR1_CEN; //disable timer
	  TIM17->CR1 &= ~TIM_CR1_DIR; //up counter
	   TIM17->CR1 |= TIM_CR1_URS; //1: Only counter overflow/underflow generates an update interrupt or DMA request if enabled. (not setting UG bit)
//	   TIM17->CR1 |= TIM_CR1_UDIS;
	   TIM17->RCR = 0; //Repetition counter value
	   TIM17->CR1 &= ~TIM_CR1_ARPE; //AutoReloadPreload disabled
//	   TIM17->SR &= ~TIM_SR_UIF;
	     TIM17->DIER |= TIM_DIER_UIE; // enable update interrupts
	 	TIM17->BDTR |= (TIM_BDTR_MOE); //1: OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in TIMx_CCER register)
	   TIM17->CCMR1 &= ~TIM_CCMR1_CC1S_0;  //configuring as output
	   TIM17->CCMR1 &= ~TIM_CCMR1_CC1S_1;
	   TIM17->CCER |= TIM_CCER_CC1E; //Output enabled
	   TIM17->CCER &= ~TIM_CCER_CC1P; //0: OC1 active high
//	   TIM17->CCER &= ~TIM_CCER_CC1NP;
	   TIM17->PSC = 15;			//1us resolution
	   TIM17->EGR |= TIM_EGR_UG;

	   NVIC_SetPriority(TIM17_IRQn, 3);
	   NVIC_SetVector(TIM17_IRQn, (uint32_t)&TIM17_IRQHandler);
}



void trg_impl_tmr17(int mode, unsigned int t1, unsigned int t2, unsigned int l_pwm, unsigned int h_pwm){

	mode_tmr17 = mode; //save to be used in isr
	 t1_tmr17 = t1;
	 t2_tmr17 = t2;
	 l_pwm_tmr17 = l_pwm;
	 h_pwm_tmr17 = h_pwm;
	num_pulse_pwm_tmr17 = 0; //initialize in the required mode


	if (mode_tmr17 == TRG_MODE_LOW){
		//==put low
//		   TIM17->PSC = 15999;
		   // shart bezaram agar az 1000 bozorg tar bud ms esh bokonam (ya bar asase pwm hast ya na)
		     TIM17->ARR = 1000;
		   // channel register
		   TIM17->CCR1 = 200;
		   //put low
		 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		 	// update generation: Re-initialize the counter and generates an update of the registers.

		   TIM17->EGR |= TIM_EGR_UG;
		   TIM17->CR1 |= TIM_CR1_CEN;

	}
	else if(mode_tmr17 == TRG_MODE_HIGH){
		//==put high
	 	TIM17->CCMR1 |= TIM_CCMR1_OC1M_0;
	 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
	 	TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
	 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

