esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
	   TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr17 == TRG_MODE_T1HIGH_LOW){
		//==put high for t1, then put low
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)t1_tmr17;
		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr17 == TRG_MODE_T1LOW_HIGH){
		//==put low for t1, then put high
		//put low
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)t1_tmr17;
		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr17 == 4){
		//==put low for t1, then put high for t2, then put low
		//put low
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)t1_tmr17;
		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr17 == 5){
		//==put high for t1, then put low for t2, then put high
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)t1_tmr17;
		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr17 == 6){
		//==start pwm for t1 (number of pulses should calculated), then put low
		num_pulse_pwm_tmr17 = (t1)/(l_pwm_tmr17+h_pwm_tmr17);

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)(h_pwm_tmr17+l_pwm_tmr17);
	  TIM17->CCR1 = (uint32_t)h_pwm_tmr17;

	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
	TIM17->CCMR1 |= TIM_CCMR1_OC1M_1;
	TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

	TIM17->EGR |= TIM_EGR_UG;
   TIM17->CR1 |= TIM_CR1_CEN;


	}
	else if (mode_tmr17 == 7){
		//==start pwm for t1, then put high
		num_pulse_pwm_tmr17 = (t1)/(l_pwm_tmr17+h_pwm_tmr17);

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)(h_pwm_tmr17+l_pwm_tmr17);
	  TIM17->CCR1 = (uint32_t)h_pwm_tmr17;

		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr17 == 8){
		//==start pwm for t1, then put high for t2, then put low
		num_pulse_pwm_tmr17 = (t1)/(l_pwm_tmr17+h_pwm_tmr17);

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)(h_pwm_tmr17+l_pwm_tmr17);
	  TIM17->CCR1 = (uint32_t)h_pwm_tmr17;

		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr17 == 9){
		//==start pwm for t1, then put low for t2, then put high
		num_pulse_pwm_tmr17 = (t1)/(l_pwm_tmr17+h_pwm_tmr17);

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)(h_pwm_tmr17+l_pwm_tmr17);
	  TIM17->CCR1 = (uint32_t)h_pwm_tmr17;

		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr17 == 10){
		//==put high for t1, then start pwm for t2, then put low
		num_pulse_pwm_tmr17 = (t2)/(l_pwm_tmr17+h_pwm_tmr17);

		TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)t1_tmr17;
		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr17 == 11){
		//==put low for t1, then start pwm for t2, then put high
		num_pulse_pwm_tmr17 = (t2)/(l_pwm_tmr17+h_pwm_tmr17);

		//put low
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM17->PSC = 15999; //us resolution
		TIM17->ARR = (uint32_t)t1_tmr17;
		TIM17->EGR |= TIM_EGR_UG;
	   TIM17->CR1 |= TIM_CR1_CEN;
	}


	TIM17->SR &= ~TIM_SR_UIF;
   NVIC_EnableIRQ(TIM17_IRQn); // Enable interrupt from TIM3 (NVIC level)
}


void TIM17_IRQHandler(void) // interrupt routine
{
	  if(TIM17->SR & TIM_SR_UIF) // if UIF flag is set
	  {
	    TIM17->SR &= ~TIM_SR_UIF; // clear UIF flag


		if (mode_tmr17 == TRG_MODE_LOW){
			//do nothing
		}
		else if(mode_tmr17 == TRG_MODE_HIGH){
			//do nothing
		}
		else if (mode_tmr17 == TRG_MODE_T1HIGH_LOW){
			//==when recieve intr(t1 done), put low
			//put low
		 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		   TIM17->EGR |= TIM_EGR_UG;
		   TIM17->CR1 &= ~TIM_CR1_CEN; //disable

		}
		else if (mode_tmr17 == TRG_MODE_T1LOW_HIGH){
			//==when recieve put high
			TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
			TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
			TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			TIM17->EGR |= TIM_EGR_UG;
		   TIM17->CR1 &= ~TIM_CR1_CEN; //disable
		}
		else if (mode_tmr17 == 4){
			//==put low for t1, then put high for t2, then put low
			static int mode4_cntr = 0;
			//first recieve: put high, set for t2
			//2nd rec: put low
			if (mode4_cntr == 0){
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM17->ARR = (uint32_t)t2_tmr17;
				TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 |= TIM_CR1_CEN;

			   mode4_cntr++;
			}
			else{
				//put low
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 &= ~TIM_CR1_CEN; //disable
				mode4_cntr = 0;
			}
		}
		else if (mode_tmr17 == 5){
			//==put high for t1, then put low for t2, then put high
			static int mode5_cntr = 0;
			//1st rec: put low, set for t2
			//2nd rec: put high
			if (mode5_cntr == 0){
				//put low
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM17->ARR = (uint32_t)t2_tmr17;
				TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 |= TIM_CR1_CEN;

