esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
			   mode5_cntr++;
			}
			else{

				TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 &= ~TIM_CR1_CEN; //disable
				mode5_cntr = 0;
			}

		}
		else if (mode_tmr17 == 6){
			//==start pwm for t1 (number of pulses should calculated), then put low
			//count numbers, when reached the value, then put low just
			static int mode6_cntr = 0;
			if(mode6_cntr<num_pulse_pwm_tmr17){
				mode6_cntr++;
			}
			else{
				//put low
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 &= ~TIM_CR1_CEN; //disable
				mode6_cntr=0;
			}

		}
		else if (mode_tmr17 == 7){
			//==start pwm for t1, then put high
			//count num of intr, when reached put high
			static int mode7_cntr = 0;
			if(mode7_cntr<num_pulse_pwm_tmr17){
				mode7_cntr++;
			}
			else{
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 &= ~TIM_CR1_CEN; //disable
				mode7_cntr=0;
			}
		}
		else if (mode_tmr17 == 8){
			//==start pwm for t1, then put high for t2, then put low
			//count numbers, when reached put high, set timer for t2, pwm_dis, the intr after that put low
			static int mode8_cntr1 = 0;
			static int mode8_cntr2 = 0;
			if(mode8_cntr1 == 0){ //state 1
				if(mode8_cntr2<num_pulse_pwm_tmr17){ //pwm counter
					mode8_cntr2++;
				}
				else{
					TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM17->ARR = (uint32_t)t2_tmr17;
					TIM17->EGR |= TIM_EGR_UG;
				   TIM17->CR1 |= TIM_CR1_CEN;

				   mode8_cntr2=0;
				   mode8_cntr1++;
				}
			}
			else{	//state 2
				//put low
			 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
			 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			 	TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
			 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 &= ~TIM_CR1_CEN; //disable
			   mode8_cntr2=0;
			   mode8_cntr1=0;
			}

		}
		else if (mode_tmr17 == 9){
			//==start pwm for t1, then put low for t2, then put high
			//count numbers, when reached put low, set timer for t2, pwm_dis, the intr after that put high
			static int mode9_cntr1 = 0;
			static int mode9_cntr2 = 0;
			if(mode9_cntr1 == 0){ //state 1
				if(mode9_cntr2<num_pulse_pwm_tmr17){ //pwm counter
					mode9_cntr2++;
				}
				else{
					//put low
				 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM17->ARR = (uint32_t)t2_tmr17;
					TIM17->EGR |= TIM_EGR_UG;
				   TIM17->CR1 |= TIM_CR1_CEN;

				   mode9_cntr2=0;
				   mode9_cntr1++;
				}
			}
			else{	//state 2
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			   TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 &= ~TIM_CR1_CEN; //disable
			   mode9_cntr2=0;
			   mode9_cntr1=0;
			}
		}
		else if (mode_tmr17 == 10){
			//==put high for t1, then start pwm for t2, then put low
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put low
			static int mode10_cntr1 = 0;
			static int mode10_cntr2 = 0;

			if (mode10_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM17->PSC = 15999; //us resolution
				TIM17->ARR = (uint32_t)(h_pwm_tmr17+l_pwm_tmr17);
			  TIM17->CCR1 = (uint32_t)h_pwm_tmr17;

				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 |= TIM_CR1_CEN;

				mode10_cntr1++; //go to next state
				mode10_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode10_cntr2<num_pulse_pwm_tmr17){ //pwm counter
					mode10_cntr2++;
				}
				else{
					//put low
				 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM17->ARR = (uint32_t)t2_tmr17;
					TIM17->EGR |= TIM_EGR_UG;
					TIM17->CR1 &= ~TIM_CR1_CEN; //disable

				   mode10_cntr2=0;
				   mode10_cntr1=0;
				}
			}

		}
		else if (mode_tmr17 == 11){
			//==put low for t1, then start pwm for t2, then put high
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put high
			static int mode11_cntr1 = 0;
			static int mode11_cntr2 = 0;

			if (mode11_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM17->PSC = 15999; //us resolution
				TIM17->ARR = (uint32_t)(h_pwm_tmr17+l_pwm_tmr17);
			  TIM17->CCR1 = (uint32_t)h_pwm_tmr17;

				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM17->EGR |= TIM_EGR_UG;
			   TIM17->CR1 |= TIM_CR1_CEN;

				mode11_cntr1++; //go to next state
				mode11_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode11_cntr2<num_pulse_pwm_tmr17){ //pwm counter
					mode11_cntr2++;
				}
				else{
					TIM17->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM17->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM17->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM17->ARR = (uint32_t)t2_tmr17;
					TIM17->EGR |= TIM_EGR_UG;
					TIM17->CR1 &= ~TIM_CR1_CEN; //disable

				   mode11_cntr2=0;
				   mode11_cntr1=0;
				}
			}
		}

	  }
}

//================== TIM14 TRIGGER ====================

void trg_init_tmr14(void){
	//clk enable
	  __HAL_RCC_TIM14_CLK_ENABLE();

	  __HAL_RCC_GPIOC_CLK_ENABLE();
	  /**TIM14 GPIO Configuration, PC12     ------> TIM14_CH1 */
	  GPIO_InitTypeDef GPIO_InitStruct = {0};
	  GPIO_InitStruct.Pin = GPIO_PIN_12;
	  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	  GPIO_InitStruct.Pull = GPIO_NOPULL;
	  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	  GPIO_InitStruct.Alternate = GPIO_AF2_TIM14;
	  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);


	  //reg initialization
	  TIM14->CR1 &= ~TIM_CR1_CEN; //disable timer
	  TIM14->CR1 &= ~TIM_CR1_DIR; //up counter
	   TIM14->CR1 |= TIM_CR1_URS; //1: Only counter overflow/underflow generates an update interrupt or DMA request if enabled. (not setting UG bit)
//	   TIM14->CR1 |= TIM_CR1_UDIS;
	   TIM14->RCR = 0; //Repetition counter value
	   TIM14->CR1 &= ~TIM_CR1_ARPE; //AutoReloadPreload disabled
//	   TIM14->SR &= ~TIM_SR_UIF;
	     TIM14->DIER |= TIM_DIER_UIE; // enable update interrupts
	 	TIM14->BDTR |= (TIM_BDTR_MOE); //1: OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in TIMx_CCER register)
	   TIM14->CCMR1 &= ~TIM_CCMR1_CC1S_0;  //configuring as output
	   TIM14->CCMR1 &= ~TIM_CCMR1_CC1S_1;
	   TIM14->CCER |= TIM_CCER_CC1E; //Output enabled
	   TIM14->CCER &= ~TIM_CCER_CC1P; //0: OC1 active high
//	   TIM14->CCER &= ~TIM_CCER_CC1NP;
	   TIM14->PSC = 15;			//1us resolution
	   TIM14->EGR |= TIM_EGR_UG;

	   NVIC_SetPriority(TIM14_IRQn, 3);
	   NVIC_SetVector(TIM14_IRQn, (uint32_t)&TIM14_IRQHandler);
}



void trg_impl_tmr14(int mode, unsigned int t1, unsigned int t2, unsigned int l_pwm, unsigned int h_pwm){

	mode_tmr14 = mode; //save to be used in isr
	 t1_tmr14 = t1;
	 t2_tmr14 = t2;
	 l_pwm_tmr14 = l_pwm;
	 h_pwm_tmr14 = h_pwm;
	num_pulse_pwm_tmr14 = 0; //initialize in the required mode


	if (mode_tmr14 == TRG_MODE_LOW){
		//==put low
//		   TIM14->PSC = 15999;
		   // shart bezaram agar az 1000 bozorg tar bud ms esh bokonam (ya bar asase pwm hast ya na)
		     TIM14->ARR = 1000;
		   // channel register
		   TIM14->CCR1 = 200;
		   //put low
		 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		 	// update generation: Re-initialize the counter and generates an update of the registers.

		   TIM14->EGR |= TIM_EGR_UG;
		   TIM14->CR1 |= TIM_CR1_CEN;

