esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
	}
	else if(mode_tmr14 == TRG_MODE_HIGH){
		//==put high
	 	TIM14->CCMR1 |= TIM_CCMR1_OC1M_0;
	 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
	 	TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
	 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

	   TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr14 == TRG_MODE_T1HIGH_LOW){
		//==put high for t1, then put low
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)t1_tmr14;
		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr14 == TRG_MODE_T1LOW_HIGH){
		//==put low for t1, then put high
		//put low
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)t1_tmr14;
		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr14 == 4){
		//==put low for t1, then put high for t2, then put low
		//put low
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)t1_tmr14;
		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr14 == 5){
		//==put high for t1, then put low for t2, then put high
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)t1_tmr14;
		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr14 == 6){
		//==start pwm for t1 (number of pulses should calculated), then put low
		num_pulse_pwm_tmr14 = (t1)/(l_pwm_tmr14+h_pwm_tmr14);

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)(h_pwm_tmr14+l_pwm_tmr14);
	  TIM14->CCR1 = (uint32_t)h_pwm_tmr14;

	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
	TIM14->CCMR1 |= TIM_CCMR1_OC1M_1;
	TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

	TIM14->EGR |= TIM_EGR_UG;
   TIM14->CR1 |= TIM_CR1_CEN;


	}
	else if (mode_tmr14 == 7){
		//==start pwm for t1, then put high
		num_pulse_pwm_tmr14 = (t1)/(l_pwm_tmr14+h_pwm_tmr14);

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)(h_pwm_tmr14+l_pwm_tmr14);
	  TIM14->CCR1 = (uint32_t)h_pwm_tmr14;

		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr14 == 8){
		//==start pwm for t1, then put high for t2, then put low
		num_pulse_pwm_tmr14 = (t1)/(l_pwm_tmr14+h_pwm_tmr14);

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)(h_pwm_tmr14+l_pwm_tmr14);
	  TIM14->CCR1 = (uint32_t)h_pwm_tmr14;

		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr14 == 9){
		//==start pwm for t1, then put low for t2, then put high
		num_pulse_pwm_tmr14 = (t1)/(l_pwm_tmr14+h_pwm_tmr14);

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)(h_pwm_tmr14+l_pwm_tmr14);
	  TIM14->CCR1 = (uint32_t)h_pwm_tmr14;

		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr14 == 10){
		//==put high for t1, then start pwm for t2, then put low
		num_pulse_pwm_tmr14 = (t2)/(l_pwm_tmr14+h_pwm_tmr14);

		TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)t1_tmr14;
		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr14 == 11){
		//==put low for t1, then start pwm for t2, then put high
		num_pulse_pwm_tmr14 = (t2)/(l_pwm_tmr14+h_pwm_tmr14);

		//put low
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM14->PSC = 15999; //us resolution
		TIM14->ARR = (uint32_t)t1_tmr14;
		TIM14->EGR |= TIM_EGR_UG;
	   TIM14->CR1 |= TIM_CR1_CEN;
	}


	TIM14->SR &= ~TIM_SR_UIF;
   NVIC_EnableIRQ(TIM14_IRQn); // Enable interrupt from TIM3 (NVIC level)
}


void TIM14_IRQHandler(void) // interrupt routine
{
	  if(TIM14->SR & TIM_SR_UIF) // if UIF flag is set
	  {
	    TIM14->SR &= ~TIM_SR_UIF; // clear UIF flag


		if (mode_tmr14 == TRG_MODE_LOW){
			//do nothing
		}
		else if(mode_tmr14 == TRG_MODE_HIGH){
			//do nothing
		}
		else if (mode_tmr14 == TRG_MODE_T1HIGH_LOW){
			//==when recieve intr(t1 done), put low
			//put low
		 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		   TIM14->EGR |= TIM_EGR_UG;
		   TIM14->CR1 &= ~TIM_CR1_CEN; //disable

		}
		else if (mode_tmr14 == TRG_MODE_T1LOW_HIGH){
			//==when recieve put high
			TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
			TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
			TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			TIM14->EGR |= TIM_EGR_UG;
		   TIM14->CR1 &= ~TIM_CR1_CEN; //disable
		}
		else if (mode_tmr14 == 4){
			//==put low for t1, then put high for t2, then put low
			static int mode4_cntr = 0;
			//first recieve: put high, set for t2
			//2nd rec: put low
			if (mode4_cntr == 0){
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM14->ARR = (uint32_t)t2_tmr14;
				TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 |= TIM_CR1_CEN;

			   mode4_cntr++;
			}
			else{
				//put low
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 &= ~TIM_CR1_CEN; //disable
				mode4_cntr = 0;
			}
		}
		else if (mode_tmr14 == 5){
			//==put high for t1, then put low for t2, then put high
			static int mode5_cntr = 0;
			//1st rec: put low, set for t2
			//2nd rec: put high
			if (mode5_cntr == 0){
				//put low
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM14->ARR = (uint32_t)t2_tmr14;
				TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 |= TIM_CR1_CEN;

