esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
			   mode5_cntr++;
			}
			else{

				TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 &= ~TIM_CR1_CEN; //disable
				mode5_cntr = 0;
			}

		}
		else if (mode_tmr14 == 6){
			//==start pwm for t1 (number of pulses should calculated), then put low
			//count numbers, when reached the value, then put low just
			static int mode6_cntr = 0;
			if(mode6_cntr<num_pulse_pwm_tmr14){
				mode6_cntr++;
			}
			else{
				//put low
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 &= ~TIM_CR1_CEN; //disable
				mode6_cntr=0;
			}

		}
		else if (mode_tmr14 == 7){
			//==start pwm for t1, then put high
			//count num of intr, when reached put high
			static int mode7_cntr = 0;
			if(mode7_cntr<num_pulse_pwm_tmr14){
				mode7_cntr++;
			}
			else{
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 &= ~TIM_CR1_CEN; //disable
				mode7_cntr=0;
			}
		}
		else if (mode_tmr14 == 8){
			//==start pwm for t1, then put high for t2, then put low
			//count numbers, when reached put high, set timer for t2, pwm_dis, the intr after that put low
			static int mode8_cntr1 = 0;
			static int mode8_cntr2 = 0;
			if(mode8_cntr1 == 0){ //state 1
				if(mode8_cntr2<num_pulse_pwm_tmr14){ //pwm counter
					mode8_cntr2++;
				}
				else{
					TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM14->ARR = (uint32_t)t2_tmr14;
					TIM14->EGR |= TIM_EGR_UG;
				   TIM14->CR1 |= TIM_CR1_CEN;

				   mode8_cntr2=0;
				   mode8_cntr1++;
				}
			}
			else{	//state 2
				//put low
			 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
			 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			 	TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
			 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 &= ~TIM_CR1_CEN; //disable
			   mode8_cntr2=0;
			   mode8_cntr1=0;
			}

		}
		else if (mode_tmr14 == 9){
			//==start pwm for t1, then put low for t2, then put high
			//count numbers, when reached put low, set timer for t2, pwm_dis, the intr after that put high
			static int mode9_cntr1 = 0;
			static int mode9_cntr2 = 0;
			if(mode9_cntr1 == 0){ //state 1
				if(mode9_cntr2<num_pulse_pwm_tmr14){ //pwm counter
					mode9_cntr2++;
				}
				else{
					//put low
				 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM14->ARR = (uint32_t)t2_tmr14;
					TIM14->EGR |= TIM_EGR_UG;
				   TIM14->CR1 |= TIM_CR1_CEN;

				   mode9_cntr2=0;
				   mode9_cntr1++;
				}
			}
			else{	//state 2
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			   TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 &= ~TIM_CR1_CEN; //disable
			   mode9_cntr2=0;
			   mode9_cntr1=0;
			}
		}
		else if (mode_tmr14 == 10){
			//==put high for t1, then start pwm for t2, then put low
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put low
			static int mode10_cntr1 = 0;
			static int mode10_cntr2 = 0;

			if (mode10_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM14->PSC = 15999; //us resolution
				TIM14->ARR = (uint32_t)(h_pwm_tmr14+l_pwm_tmr14);
			  TIM14->CCR1 = (uint32_t)h_pwm_tmr14;

				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 |= TIM_CR1_CEN;

				mode10_cntr1++; //go to next state
				mode10_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode10_cntr2<num_pulse_pwm_tmr14){ //pwm counter
					mode10_cntr2++;
				}
				else{
					//put low
				 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM14->ARR = (uint32_t)t2_tmr14;
					TIM14->EGR |= TIM_EGR_UG;
					TIM14->CR1 &= ~TIM_CR1_CEN; //disable

				   mode10_cntr2=0;
				   mode10_cntr1=0;
				}
			}

		}
		else if (mode_tmr14 == 11){
			//==put low for t1, then start pwm for t2, then put high
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put high
			static int mode11_cntr1 = 0;
			static int mode11_cntr2 = 0;

			if (mode11_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM14->PSC = 15999; //us resolution
				TIM14->ARR = (uint32_t)(h_pwm_tmr14+l_pwm_tmr14);
			  TIM14->CCR1 = (uint32_t)h_pwm_tmr14;

				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM14->EGR |= TIM_EGR_UG;
			   TIM14->CR1 |= TIM_CR1_CEN;

				mode11_cntr1++; //go to next state
				mode11_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode11_cntr2<num_pulse_pwm_tmr14){ //pwm counter
					mode11_cntr2++;
				}
				else{
					TIM14->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM14->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM14->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM14->ARR = (uint32_t)t2_tmr14;
					TIM14->EGR |= TIM_EGR_UG;
					TIM14->CR1 &= ~TIM_CR1_CEN; //disable

				   mode11_cntr2=0;
				   mode11_cntr1=0;
				}
			}
		}

	  }
}


//================== TIM15 TRIGGER ====================

void trg_init_tmr15(void){
	//clk enable
	  __HAL_RCC_TIM15_CLK_ENABLE();

	    __HAL_RCC_GPIOC_CLK_ENABLE();
	    /**TIM15 GPIO Configuration, PC1     ------> TIM15_CH1 */
	    GPIO_InitTypeDef GPIO_InitStruct = {0};
	    GPIO_InitStruct.Pin = GPIO_PIN_1;
	    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
	    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	    GPIO_InitStruct.Alternate = GPIO_AF2_TIM15;
	    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);


	  //reg initialization
	  TIM15->CR1 &= ~TIM_CR1_CEN; //disable timer
	  TIM15->CR1 &= ~TIM_CR1_DIR; //up counter
	   TIM15->CR1 |= TIM_CR1_URS; //1: Only counter overflow/underflow generates an update interrupt or DMA request if enabled. (not setting UG bit)
//	   TIM15->CR1 |= TIM_CR1_UDIS;
	   TIM15->RCR = 0; //Repetition counter value
	   TIM15->CR1 &= ~TIM_CR1_ARPE; //AutoReloadPreload disabled
//	   TIM15->SR &= ~TIM_SR_UIF;
	     TIM15->DIER |= TIM_DIER_UIE; // enable update interrupts
	 	TIM15->BDTR |= (TIM_BDTR_MOE); //1: OC and OCN outputs are enabled if their respective enable bits are set (CCxE, CCxNE in TIMx_CCER register)
	   TIM15->CCMR1 &= ~TIM_CCMR1_CC1S_0;  //configuring as output
	   TIM15->CCMR1 &= ~TIM_CCMR1_CC1S_1;
	   TIM15->CCER |= TIM_CCER_CC1E; //Output enabled
	   TIM15->CCER &= ~TIM_CCER_CC1P; //0: OC1 active high
//	   TIM15->CCER &= ~TIM_CCER_CC1NP;
	   TIM15->PSC = 15;			//1us resolution
	   TIM15->EGR |= TIM_EGR_UG;

	   NVIC_SetPriority(TIM15_IRQn, 3);
	   NVIC_SetVector(TIM15_IRQn, (uint32_t)&TIM15_IRQHandler);
}



