esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
void trg_impl_tmr15(int mode, unsigned int t1, unsigned int t2, unsigned int l_pwm, unsigned int h_pwm){

	mode_tmr15 = mode; //save to be used in isr
	 t1_tmr15 = t1;
	 t2_tmr15 = t2;
	 l_pwm_tmr15 = l_pwm;
	 h_pwm_tmr15 = h_pwm;
	num_pulse_pwm_tmr15 = 0; //initialize in the required mode


	if (mode_tmr15 == TRG_MODE_LOW){
		//==put low
//		   TIM15->PSC = 15999;
		   // shart bezaram agar az 1000 bozorg tar bud ms esh bokonam (ya bar asase pwm hast ya na)
		     TIM15->ARR = 1000;
		   // channel register
		   TIM15->CCR1 = 200;
		   //put low
		 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		 	// update generation: Re-initialize the counter and generates an update of the registers.

		   TIM15->EGR |= TIM_EGR_UG;
		   TIM15->CR1 |= TIM_CR1_CEN;

	}
	else if(mode_tmr15 == TRG_MODE_HIGH){
		//==put high
	 	TIM15->CCMR1 |= TIM_CCMR1_OC1M_0;
	 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
	 	TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
	 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

	   TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr15 == TRG_MODE_T1HIGH_LOW){
		//==put high for t1, then put low
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)t1_tmr15;
		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr15 == TRG_MODE_T1LOW_HIGH){
		//==put low for t1, then put high
		//put low
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)t1_tmr15;
		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr15 == 4){
		//==put low for t1, then put high for t2, then put low
		//put low
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)t1_tmr15;
		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr15 == 5){
		//==put high for t1, then put low for t2, then put high
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)t1_tmr15;
		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr15 == 6){
		//==start pwm for t1 (number of pulses should calculated), then put low
		num_pulse_pwm_tmr15 = (t1)/(l_pwm_tmr15+h_pwm_tmr15);

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)(h_pwm_tmr15+l_pwm_tmr15);
	  TIM15->CCR1 = (uint32_t)h_pwm_tmr15;

	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
	TIM15->CCMR1 |= TIM_CCMR1_OC1M_1;
	TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

	TIM15->EGR |= TIM_EGR_UG;
   TIM15->CR1 |= TIM_CR1_CEN;


	}
	else if (mode_tmr15 == 7){
		//==start pwm for t1, then put high
		num_pulse_pwm_tmr15 = (t1)/(l_pwm_tmr15+h_pwm_tmr15);

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)(h_pwm_tmr15+l_pwm_tmr15);
	  TIM15->CCR1 = (uint32_t)h_pwm_tmr15;

		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr15 == 8){
		//==start pwm for t1, then put high for t2, then put low
		num_pulse_pwm_tmr15 = (t1)/(l_pwm_tmr15+h_pwm_tmr15);

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)(h_pwm_tmr15+l_pwm_tmr15);
	  TIM15->CCR1 = (uint32_t)h_pwm_tmr15;

		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr15 == 9){
		//==start pwm for t1, then put low for t2, then put high
		num_pulse_pwm_tmr15 = (t1)/(l_pwm_tmr15+h_pwm_tmr15);

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)(h_pwm_tmr15+l_pwm_tmr15);
	  TIM15->CCR1 = (uint32_t)h_pwm_tmr15;

		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;
	}
	else if (mode_tmr15 == 10){
		//==put high for t1, then start pwm for t2, then put low
		num_pulse_pwm_tmr15 = (t2)/(l_pwm_tmr15+h_pwm_tmr15);

		TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)t1_tmr15;
		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;

	}
	else if (mode_tmr15 == 11){
		//==put low for t1, then start pwm for t2, then put high
		num_pulse_pwm_tmr15 = (t2)/(l_pwm_tmr15+h_pwm_tmr15);

		//put low
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//		TIM15->PSC = 15999; //us resolution
		TIM15->ARR = (uint32_t)t1_tmr15;
		TIM15->EGR |= TIM_EGR_UG;
	   TIM15->CR1 |= TIM_CR1_CEN;
	}


	TIM15->SR &= ~TIM_SR_UIF;
   NVIC_EnableIRQ(TIM15_IRQn); // Enable interrupt from TIM3 (NVIC level)
}


void TIM15_IRQHandler(void) // interrupt routine
{
	  if(TIM15->SR & TIM_SR_UIF) // if UIF flag is set
	  {
	    TIM15->SR &= ~TIM_SR_UIF; // clear UIF flag


		if (mode_tmr15 == TRG_MODE_LOW){
			//do nothing
		}
		else if(mode_tmr15 == TRG_MODE_HIGH){
			//do nothing
		}
		else if (mode_tmr15 == TRG_MODE_T1HIGH_LOW){
			//==when recieve intr(t1 done), put low
			//put low
		 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
		 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
		 	TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
		 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;
		   TIM15->EGR |= TIM_EGR_UG;
		   TIM15->CR1 &= ~TIM_CR1_CEN; //disable

