esl-epfl/event-driven_edf-freertos/Core/Src/stm32_trg_driver.c
		}
		else if (mode_tmr15 == TRG_MODE_T1LOW_HIGH){
			//==when recieve put high
			TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
			TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
			TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			TIM15->EGR |= TIM_EGR_UG;
		   TIM15->CR1 &= ~TIM_CR1_CEN; //disable
		}
		else if (mode_tmr15 == 4){
			//==put low for t1, then put high for t2, then put low
			static int mode4_cntr = 0;
			//first recieve: put high, set for t2
			//2nd rec: put low
			if (mode4_cntr == 0){
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM15->ARR = (uint32_t)t2_tmr15;
				TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 |= TIM_CR1_CEN;

			   mode4_cntr++;
			}
			else{
				//put low
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 &= ~TIM_CR1_CEN; //disable
				mode4_cntr = 0;
			}
		}
		else if (mode_tmr15 == 5){
			//==put high for t1, then put low for t2, then put high
			static int mode5_cntr = 0;
			//1st rec: put low, set for t2
			//2nd rec: put high
			if (mode5_cntr == 0){
				//put low
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM15->ARR = (uint32_t)t2_tmr15;
				TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 |= TIM_CR1_CEN;

			   mode5_cntr++;
			}
			else{

				TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 &= ~TIM_CR1_CEN; //disable
				mode5_cntr = 0;
			}

		}
		else if (mode_tmr15 == 6){
			//==start pwm for t1 (number of pulses should calculated), then put low
			//count numbers, when reached the value, then put low just
			static int mode6_cntr = 0;
			if(mode6_cntr<num_pulse_pwm_tmr15){
				mode6_cntr++;
			}
			else{
				//put low
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 &= ~TIM_CR1_CEN; //disable
				mode6_cntr=0;
			}

		}
		else if (mode_tmr15 == 7){
			//==start pwm for t1, then put high
			//count num of intr, when reached put high
			static int mode7_cntr = 0;
			if(mode7_cntr<num_pulse_pwm_tmr15){
				mode7_cntr++;
			}
			else{
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 &= ~TIM_CR1_CEN; //disable
				mode7_cntr=0;
			}
		}
		else if (mode_tmr15 == 8){
			//==start pwm for t1, then put high for t2, then put low
			//count numbers, when reached put high, set timer for t2, pwm_dis, the intr after that put low
			static int mode8_cntr1 = 0;
			static int mode8_cntr2 = 0;
			if(mode8_cntr1 == 0){ //state 1
				if(mode8_cntr2<num_pulse_pwm_tmr15){ //pwm counter
					mode8_cntr2++;
				}
				else{
					TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM15->ARR = (uint32_t)t2_tmr15;
					TIM15->EGR |= TIM_EGR_UG;
				   TIM15->CR1 |= TIM_CR1_CEN;

				   mode8_cntr2=0;
				   mode8_cntr1++;
				}
			}
			else{	//state 2
				//put low
			 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
			 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
			 	TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
			 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;
			   TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 &= ~TIM_CR1_CEN; //disable
			   mode8_cntr2=0;
			   mode8_cntr1=0;
			}

		}
		else if (mode_tmr15 == 9){
			//==start pwm for t1, then put low for t2, then put high
			//count numbers, when reached put low, set timer for t2, pwm_dis, the intr after that put high
			static int mode9_cntr1 = 0;
			static int mode9_cntr2 = 0;
			if(mode9_cntr1 == 0){ //state 1
				if(mode9_cntr2<num_pulse_pwm_tmr15){ //pwm counter
					mode9_cntr2++;
				}
				else{
					//put low
				 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

					TIM15->ARR = (uint32_t)t2_tmr15;
					TIM15->EGR |= TIM_EGR_UG;
				   TIM15->CR1 |= TIM_CR1_CEN;

				   mode9_cntr2=0;
				   mode9_cntr1++;
				}
			}
			else{	//state 2
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

			   TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 &= ~TIM_CR1_CEN; //disable
			   mode9_cntr2=0;
			   mode9_cntr1=0;
			}
		}
		else if (mode_tmr15 == 10){
			//==put high for t1, then start pwm for t2, then put low
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put low
			static int mode10_cntr1 = 0;
			static int mode10_cntr2 = 0;

			if (mode10_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM15->PSC = 15999; //us resolution
				TIM15->ARR = (uint32_t)(h_pwm_tmr15+l_pwm_tmr15);
			  TIM15->CCR1 = (uint32_t)h_pwm_tmr15;

				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 |= TIM_CR1_CEN;

				mode10_cntr1++; //go to next state
				mode10_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode10_cntr2<num_pulse_pwm_tmr15){ //pwm counter
					mode10_cntr2++;
				}
				else{
					//put low
				 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0;
				 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
				 	TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				 	TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM15->ARR = (uint32_t)t2_tmr15;
					TIM15->EGR |= TIM_EGR_UG;
					TIM15->CR1 &= ~TIM_CR1_CEN; //disable

				   mode10_cntr2=0;
				   mode10_cntr1=0;
				}
			}

		}
		else if (mode_tmr15 == 11){
			//==put low for t1, then start pwm for t2, then put high
			//1st: (pwm_disabled) set pwm,
			//count for t2, when done, put high
			static int mode11_cntr1 = 0;
			static int mode11_cntr2 = 0;

			if (mode11_cntr1 == 0){ //state1: t1 finished, set the t2
//				TIM15->PSC = 15999; //us resolution
				TIM15->ARR = (uint32_t)(h_pwm_tmr15+l_pwm_tmr15);
			  TIM15->CCR1 = (uint32_t)h_pwm_tmr15;

				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_0; //pwm1
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_1;
				TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
				TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

				TIM15->EGR |= TIM_EGR_UG;
			   TIM15->CR1 |= TIM_CR1_CEN;

				mode11_cntr1++; //go to next state
				mode11_cntr2 = 0;
			}

			else{ //state2: pwm
				if(mode11_cntr2<num_pulse_pwm_tmr15){ //pwm counter
					mode11_cntr2++;
				}
				else{
					TIM15->CCMR1 |= TIM_CCMR1_OC1M_0; //put high
					TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_1;
					TIM15->CCMR1 |= TIM_CCMR1_OC1M_2;
					TIM15->CCMR1 &= ~TIM_CCMR1_OC1M_3;

//					TIM15->ARR = (uint32_t)t2_tmr15;
					TIM15->EGR |= TIM_EGR_UG;
					TIM15->CR1 &= ~TIM_CR1_CEN; //disable

				   mode11_cntr2=0;
				   mode11_cntr1=0;
				}
			}
		}

	  }
}


